[
  {
    "title": "The Dark Knight",
    "director": "Christopher Nolan",
    "genre": ["Action"],
    "releaseDate": "2008-07-18",
    "duration": 152,
    "description": "When the menace known as The Joker emerges from his mysterious past, he wreaks havoc and chaos on the people of Gotham. The Dark Knight must accept one of the greatest psychological and physical tests of his ability to fight injustice."
  },
  {
    "title": "The Matrix",
    "director": "The Wachowskis",
    "genre": ["Action"],
    "releaseDate": "1999-03-31",
    "duration": 136,
    "description": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers."
  },
  {
    "title": "Inception",
    "director": "Christopher Nolan",
    "genre": ["Action"],
    "releaseDate": "2010-07-16",
    "duration": 148,
    "description": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a CEO."
  },
  {
    "title": "The Dark Knight Rises",
    "director": "Christopher Nolan",
    "genre": ["Action"],
    "releaseDate": "2012-07-20",
    "duration": 164,
    "description": "Eight years after the Joker's reign of anarchy, Batman, with the help of the enigmatic Catwoman, is forced from his exile to save Gotham City from the brutal guerrilla terrorist Bane."
  },
  {
    "title": "Mad Max: Fury Road",
    "director": "George Miller",
    "genre": ["Action"],
    "releaseDate": "2015-05-15",
    "duration": 120,
    "description": "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search of her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max."
  },
  {
    "title": "The Exorcist",
    "director": "William Friedkin",
    "genre": ["Horror"],
    "releaseDate": "1973-12-26",
    "duration": 122,
    "description": "When a teenage girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter."
  },
  {
    "title": "The Shining",
    "director": "Stanley Kubrick",
    "genre": ["Horror"],
    "releaseDate": "1980-05-23",
    "duration": 146,
    "description": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future."
  },
  {
    "title": "Psycho",
    "director": "Alfred Hitchcock",
    "genre": ["Horror"],
    "releaseDate": "1960-06-16",
    "duration": 109,
    "description": "A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run, and checks into a remote motel run by a young man under the domination of his mother."
  },
  {
    "title": "Halloween",
    "director": "John Carpenter",
    "genre": ["Horror"],
    "releaseDate": "1978-10-25",
    "duration": 91,
    "description": "Fifteen years after murdering his sister on Halloween night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield, Illinois to kill again."
  },
  {
    "title": "The Conjuring",
    "director": "James Wan",
    "genre": ["Horror"],
    "releaseDate": "2013-07-19",
    "duration": 112,
    "description": "Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse."
  },
  {
    "title": "The Hangover",
    "director": "Todd Phillips",
    "genre": ["Comedy"],
    "releaseDate": "2009-06-05",
    "duration": 100,
    "description": "Three friends wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing."
  },
  {
    "title": "Superbad",
    "director": "Greg Mottola",
    "genre": ["Comedy"],
    "releaseDate": "2007-08-17",
    "duration": 113,
    "description": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry."
  },
  {
    "title": "Anchorman: The Legend of Ron Burgundy",
    "director": "Adam McKay",
    "genre": ["Comedy"],
    "releaseDate": "2004-07-09",
    "duration": 94,
    "description": "Ron Burgundy is San Diego's top-rated newsman in the male-dominated broadcasting of the 1970s, but that's all about to change for Ron and his cronies when an ambitious woman is hired as a new anchor."
  },
  {
    "title": "Dumb and Dumber",
    "director": "Peter Farrelly",
    "genre": ["Comedy"],
    "releaseDate": "1994-12-16",
    "duration": 107,
    "description": "After a woman leaves a briefcase at the airport terminal, a dumb limo driver and his dumber friend set out on a hilarious cross-country road trip to Aspen to return it."
  },
  {
    "title": "Monty Python and the Holy Grail",
    "director": "Terry Gilliam, Terry Jones",
    "genre": ["Comedy"],
    "releaseDate": "1975-05-23",
    "duration": 91,
    "description": "King Arthur and his Knights of the Round Table embark on a surreal, low-budget search for the Holy Grail, encountering many, very silly obstacles."
  },
  {
    "title": "Won't You Be My Neighbor?",
    "director": "Morgan Neville",
    "genre": ["Documentary"],
    "releaseDate": "2018-06-08",
    "duration": 94,
    "description": "An exploration of the life, lessons, and legacy of iconic children's television host, Fred Rogers."
  },
  {
    "title": "March of the Penguins",
    "director": "Luc Jacquet",
    "genre": ["Documentary"],
    "releaseDate": "2005-01-26",
    "duration": 85,
    "description": "A documentary that follows the annual journey of the emperor penguins of Antarctica as they march, single file, to their traditional breeding ground."
  },
  {
    "title": "Fahrenheit 9/11",
    "director": "Michael Moore",
    "genre": ["Documentary"],
    "releaseDate": "2004-06-25",
    "duration": 122,
    "description": "Filmmaker Michael Moore explores the presidency of George W. Bush and the impact of his administration's policies, focusing on the September 11 attacks, the War on Terror, and the Iraq War."
  },
  {
    "title": "Blackfish",
    "director": "Gabriela Cowperthwaite",
    "genre": ["Documentary"],
    "releaseDate": "2013-07-19",
    "duration": 83,
    "description": "A documentary that explores the consequences of keeping killer whales in captivity, focusing on the story of Tilikum, a performing orca that has killed several people while in captivity."
  },
  {
    "title": "The Act of Killing",
    "director": "Joshua Oppenheimer",
    "genre": ["Documentary"],
    "releaseDate": "2012-12-14",
    "duration": 159,
    "description": "A documentary that challenges former Indonesian death squad leaders to reenact their real-life mass killings in whatever cinematic genres they wish, including classic Hollywood crime scenarios and lavish musical numbers."
  },
  {
    "title": "Harry Potter and the Sorcerer's Stone",
    "director": "Chris Columbus",
    "genre": ["Fantasy"],
    "releaseDate": "2001-11-16",
    "duration": 152,
    "description": "An orphaned boy enrolls in a school of wizardry, where he learns the truth about himself, his family, and the terrible evil that haunts the magical world."
  },
  {
    "title": "The Lord of the Rings: The Two Towers",
    "director": "Peter Jackson",
    "genre": ["Fantasy"],
    "releaseDate": "2002-12-18",
    "duration": 179,
    "description": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard."
  },
  {
    "title": "Pan's Labyrinth",
    "director": "Guillermo del Toro",
    "genre": ["Fantasy"],
    "releaseDate": "2006-01-19",
    "duration": 118,
    "description": "In the Falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world."
  },
  {
    "title": "Spirited Away",
    "director": "Hayao Miyazaki",
    "genre": ["Fantasy"],
    "releaseDate": "2001-07-20",
    "duration": 125,
    "description": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts."
  },
  {
    "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
    "director": "Andrew Adamson",
    "genre": ["Fantasy"],
    "releaseDate": "2005-12-09",
    "duration": 143,
    "description": "Four kids travel through a wardrobe to the land of Narnia and learn of their destiny to free it with the guidance of a mystical lion."
  }
]
